lesnikovskiy/mastering_stm32/002UARTExcercise/Core/Src/main.c
#include "stm32l476xx.h"
#include "stm32l4xx_hal.h"
#include <string.h>

void SystemClockConfig(void);
void UART2_Init(void);
void Error_Handler(void);

UART_HandleTypeDef huart2;

char *user_data = "The application is running\r\n";

int main(void) {
	HAL_Init();
	SystemClockConfig();

	UART2_Init();

	HAL_UART_Transmit(&huart2, (uint8_t*) user_data, strlen(user_data), HAL_MAX_DELAY);

	uint8_t rcvd_data = { 0 };
	uint8_t data_buffer[100];
	uint32_t count = 0;

	while (1) {
		HAL_UART_Receive(&huart2, &rcvd_data, 1, HAL_MAX_DELAY);
		if (rcvd_data == '\r') {
			break;
		}

		data_buffer[count++] = rcvd_data;
	}

	HAL_UART_Transmit(&huart2, data_buffer, count, HAL_MAX_DELAY);

	while (1);

	return 0;
}

void SystemClockConfig(void) {
	// TODO: Use it later
}

void UART2_Init(void) {
	huart2.Instance = USART2;
	huart2.Init.BaudRate = 115200;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Parity = UART_PARITY_NONE;
	huart2.Init.Mode = UART_MODE_TX_RX;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16;

	if (HAL_UART_Init(&huart2) != HAL_OK) {
		Error_Handler();
	}
}

void Error_Handler(void) {
	// blink red LED
}
